Revit 2026 API

# RevitCommandIdLookupPostableCommandId Method

---

Looks up and retrieves the Revit command id with the given id string.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static RevitCommandId LookupPostableCommandId(
	PostableCommand postableCommand
)
```
```vb
Public Shared Function LookupPostableCommandId (
	postableCommand As PostableCommand
) As RevitCommandId
```
```cpp
public:
static RevitCommandId^ LookupPostableCommandId(
	PostableCommand postableCommand
)
```
```fsharp
static member LookupPostableCommandId :
        postableCommand : PostableCommand -> RevitCommandId
```

#### Parameters

postableCommand PostableCommand
    The postable command.

#### Return Value

RevitCommandId The Revit command id. Returning  if a command with the given name was not found.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when name is . |

#### Reference

RevitCommandId Class

Autodesk.Revit.UI Namespace